       01  RECORD.
           05  TP                  PIC X(1).
           05  RECORD-ID           PIC 9(5).
           05  CUSTOMER-NAME       PIC X(20).
           05  ORDER-VALUE         PIC 9(9)V99.
           05  FILLER              PIC X(11).
